# Lab-Data-Manipulation - Group By and Joins

In [7]:
# setup from last exercise

import pandas as pd

ufo = pd.read_csv('data/ufo.csv', sep=';')
ufo_vars = ufo.loc[:, ['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]
ufo_us = ufo_vars.loc[ufo_vars['country'] == 'us', :]

The second part of this lab consists of grouping and merging results to obtain valuable information.

# Grouping up the results.

## Let's calculate the average of the encounter for each country.

We should now group the results by the country column to see what is the mean encounter_seconds for each country. Do this using the `groupby` method of your dataframe `ufo_vars`. What is the average of the encounter for the us? And for Canada?

Remember that after grouping by a column, you have to specify a `aggregating function`. If you don't do that, the results of the groupby will only be a `groupby` pandas object. For this case, we want the aggregating function to be the `mean` function and then the results will appear for us.

Also remember that **if you don't** specify the `as_index=False` argument, the variables you use to group are going to become your new indexes.

Expected output:

>
>|    | country   |    year |   month |   encounter_seconds |
|---:|:----------|--------:|--------:|--------------------:|
|  0 | au        | 2002.69 | 6.12825 |             3806.47 |
|  1 | ca        | 2003.69 | 6.86167 |            28859.43 |
|  2 | de        | 2001.54 | 6.24762 |            24255.98 |
|  3 | gb        | 2003.65 | 6.5622  |            66061.32 |
|  4 | us        | 2004.09 | 6.8616  |             5800.19 |

In [9]:
ufo_vars.groupby(by='country', as_index=False).mean()

  country         year     month  encounter_length
0      au  2002.693309  6.128253       3806.469238
1      ca  2003.694333  6.861667      28859.437007
2      de  2001.542857  6.247619      24255.980952
3      gb  2003.648294  6.562205      66061.321207
4      us  2004.090057  6.861597       5800.192049

## Perform the same task, but instead of calculating the mean, count how many occurrances for each country.

For this case, the aggregating function should be the `count` function. Try to understand the results for each column.

Expected output:

>
>|    | country   |   year |   month |   state |   ufo_shape |   encounter_seconds |
|---:|:----------|-------:|--------:|--------:|------------:|--------------------:|
|  0 | au        |    538 |     538 |      10 |         527 |                 538 |
|  1 | ca        |   3000 |    3000 |    2985 |        2955 |                3000 |
|  2 | de        |    105 |     105 |       0 |         103 |                 105 |
|  3 | gb        |   1905 |    1905 |      12 |        1855 |                1905 |
|  4 | us        |  65114 |   65114 |   65114 |       63561 |               65112 |

In [11]:
ufo_vars.groupby(by='country', as_index=False).count()

  country   year  month  state  ufo_shape  encounter_length
0      au    538    538     10        527               538
1      ca   3000   3000   2985       2955              3000
2      de    105    105      0        103               105
3      gb   1905   1905     12       1855              1905
4      us  65114  65114  65114      63561             65112

## Perform the same task, but instead of calculating the mean, use the `.describe()` aggregating function to see the effects.

The describe aggregating function will show you several important statistics for the grouped results, such as `mean`, `median`, `standard deviation`, `count`, `max`, `min`, and so on.

*Hint: If it starts to get difficult to see the results, you can tranpose the resulting dataframe by just putting a `.T` at the end.*

Expected output:

>
>|                   |   count |       mean |          std |      min |   25% |   50% |   75% |           max |
|:------------------|--------:|-----------:|-------------:|---------:|------:|------:|------:|--------------:|
| year              |   80332 | 2003.85    |     10.4268  | 1906     |  2001 |  2006 |  2011 | 2014          |
| month             |   80332 |    6.83491 |      3.23486 |    1     |     4 |     7 |     9 |   12          |
| encounter_seconds |   80329 | 9017.23    | 620228       |    0.001 |    30 |   180 |   600 |    97836000   |

In [14]:
ufo_vars.describe().T

,count,mean,std,min,25%,50%,75%,max
year,80332.0,2003.850085,10.426832,1906.000,2001.0,2006.0,2011.0,2014.0
month,80332.0,6.834910,3.234863,1.000,4.0,7.0,9.0,12.0
encounter_length,80329.0,9017.225634,620228.369318,0.001,30.0,180.0,600.0,97836000.0

## Now, let's get deeper in the analysis and group the results not only by country. But by `country` and `year`

### Check the values of the mean and count for the `encounter_seconds` variable for each year. Can you see some discrepancy?

*Hint*: If you want, you can use the `ufo_us` dataset just to see the results for the united states. You could also (in a hacky way) perform the filter right before the groupby operation if you wanted.

In [16]:
ufo_us.groupby(by=['country', 'year']).agg(encounter_mean = ('encounter_length', 'mean'),
                                       encounter_count = ('encounter_length', 'count'))

              encounter_mean  encounter_count
country year
us      1910      120.000000                2
        1920       60.000000                1
        1925       60.000000                1
        1929       60.000000                1
        1931      930.000000                2
...                      ...              ...
        2010     2271.987232             3548
        2011     2544.292555             4379
        2012    10640.644916             6320
        2013     1266.387888             6056
        2014      782.372979             1964

[83 rows x 2 columns]

# BONUS 2: Which months are the ones with the highest numbers of occurrences?

**Example of output:**

>
>|   month |   occurrences |
|--------:|--------------:|
|       7 |          9520 |
|       8 |          8636 |
|       6 |          8152 |
|       9 |          7589 |
|      10 |          7407 |
|      11 |          6739 |
|       1 |          5689 |
|      12 |          5665 |
|       4 |          5527 |
|       3 |          5450 |
|       5 |          5293 |
|       2 |          4665 |

In [24]:
ufo.groupby(by=['month']).agg(encounter_count = ('encounter_length', 'count')).sort_values(ascending=False,
    by='encounter_count')

       encounter_count
month
7                 9519
8                 8636
6                 8152
9                 7589
10                7407
11                6739
1                 5689
12                5665
4                 5526
3                 5450
5                 5293
2                 4664

# BONUS 3: Finally, you gathered information about the UFO dataset. Using your last result, try to bring that information for your original dataset.

1. Store the results of your previous analysis (the mean value for the encounter_seconds for each year and each country) in a dataframe called `avg_results`. 

Expected output:
>
>|     | country   |   year |   encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

In [25]:
avg_results = ufo.groupby(by=['country', 'year']).agg(encounter_mean = ('encounter_length', 'mean'),
                                       encounter_count = ('encounter_length', 'count'))

2. Rename the column named `encounter_seconds` to `avg_encounter_seconds`.

Expected output:
>
>|     | country   |   year |   avg_encounter_seconds |
|----:|:----------|-------:|--------------------:|
|   0 | au        |   1958 |      2700           |
|   1 | au        |   1960 |       180           |
|   2 | au        |   1967 |       300           |
|   3 | au        |   1968 |       300           |
|   4 | au        |   1972 |       403.333       | 
|   ... | ...        |   ... |       ...       | 
| 277 | us        |   2010 |      2271.99        |
| 278 | us        |   2011 |      2544.29        |
| 279 | us        |   2012 |     10640.6         |
| 280 | us        |   2013 |      1266.39        |
| 281 | us        |   2014 |       782.373       |

3. Use the pd.merge( ... ) function to bring that new collected information to your original dataset.
The pd.merge() function requires several arguments, let's understand the most important ones.

`left` is the dataframe you want to bring information **to** - the table on the left. 

`right` is the dataframe you want to bring information **from** - the table on the right. 

`on` is the key you want to perform the merge. That is, if those values are **exactly equal** in both dataframes, then the information will be brought.

Put your results on a dataframe called `merged_ufo`

In [26]:
merged_ufo = pd.merge(ufo, avg_results, on=['country', 'year'])

merged_ufo.head()

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude,encounter_mean,encounter_count
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111,523.333333,15
1,1706,1949-10-15,1949,10,15,10/15/1949 20:00,baltimore,md,us,cigar,180.0,2-3 minutes,It was around 8:PM and I was walking home&#44i...,3/4/2008,39.290278,-76.612500,523.333333,15
2,35615,1949-04-10,1949,4,10,4/10/1949 15:00,seattle,wa,us,disk,600.0,ten minutes,UFO Hovers over Seattle sky,4/27/2004,47.606389,-122.330833,523.333333,15
3,41489,1949-05-01,1949,5,1,5/1/1949 14:00,oak ridge (drive),wv,us,other,40.0,40seconds,log shape whooshing object observed near charl...,3/19/2002,38.075000,-81.109722,523.333333,15
4,42287,1949-05-15,1949,5,15,5/15/1949 06:30,grays,sc,us,light,300.0,2-5 min.,I am not sure of the exact date or time of thi...,10/31/2003,32.673611,-81.020556,523.333333,15

Check how many rows the final result has and try to explain it. Did the dataset get smaller? Bigger? Or the same? Can you explain why? 

*hint: If you've found something weird, try looking back at your original dataframe and find something interesting on it.*

In [30]:
ufo.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,80332.0,40165.500000,23189.995249,0.000000,20082.750000,40165.500000,60248.250000,8.033100e+04
year,80332.0,2003.850085,10.426832,1906.000000,2001.000000,2006.000000,2011.000000,2.014000e+03
month,80332.0,6.834910,3.234863,1.000000,4.000000,7.000000,9.000000,1.200000e+01
day,80332.0,14.999714,8.903706,1.000000,7.000000,15.000000,22.000000,3.100000e+01
encounter_length,80329.0,9017.225634,620228.369318,0.001000,30.000000,180.000000,600.000000,9.783600e+07
latitude,80331.0,38.124477,10.469636,-82.862752,34.134722,39.411111,42.788333,7.270000e+01
longitude,80332.0,-86.772885,39.697205,-176.658056,-112.073333,-87.903611,-78.755000,1.784419e+02

In [31]:
pd.merge(ufo, avg_results, on=['country', 'year'], how='left')

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude,encounter_mean,encounter_count
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111,523.333333,15.0
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082,NaN,NaN
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667,610.000000,2.0
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833,658.230769,39.0
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611,1187.941176,51.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80327,80327,2013-09-09,2013,9,9,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,9/30/2013,36.165833,-86.784444,1266.387888,6056.0
80328,80328,2013-09-09,2013,9,9,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,9/30/2013,43.613611,-116.202500,1266.387888,6056.0
80329,80329,2013-09-09,2013,9,9,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,9/30/2013,38.297222,-122.284444,1266.387888,6056.0
80330,80330,2013-09-09,2013,9,9,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,9/30/2013,38.901111,-77.265556,1266.387888,6056.0
80331,80331,2013-09-09,2013,9,9,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,9/30/2013,35.652778,-97.477778,1266.387888,6056.0

In [47]:
print('Difference:',  len(ufo) - len(merged_ufo))
print('Null values:', ufo['country'].isna().sum())

Difference: 9670
Null values: 9670

## Store the results into a new csv file called `ufo_enriched.csv`. 

Don't forget to use `index=False`.

In [46]:

merged_ufo.drop(columns='Unnamed: 0').to_csv('data/ufo_enriched.csv', index=False)